---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArray.GetEnumerator
source: html/1ba64c25-93ea-af12-db6b-127ba1fd4b98.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.